content/post/2025/11/15/lisp-1.org
** Tokenization

The tokenizer splits the text into identifiers and symbols. We’ll split by whitespace, treating ~(~ and ~)~ as separate tokens.

#+BEGIN_SRC rust
#[test]
fn test_tokenizer() {
    let mut tokenizer = Tokenizer::new("12 #true (+ 1 2)");
    assert_eq!(
        tokenizer.collect::<Vec<_>>(),
        &["12", "#true", "(", "+", "1", "2", ")"]
    );
}
#+END_SRC

To implement a tokenizer, we will create a ~Tokenizer~ that contains the text
that is being tokenized, and a cursor on where we are at. When asked for the
next token, we will parse the token at ~position~ and advance ~position~ an
entire token.

#+BEGIN_SRC rust
#[derive(Debug, Clone)]
pub struct Tokenizer<'a> {
    input: &'a str,
    position: usize,
}

impl<'a> Tokenizer<'a> {
    pub fn new(input: &'a str) -> Self {
        Self { input, position: 0 }
    }
}
#+END_SRC

To parse the next token, we will

1. Skip any whitespace since whitespace is not meaningful.
2. Peek at the next character.
  - If it is a parenthesis, then we will return that as a token and advance the
    position by just a single character.
  - If it is an identifier, then we will parse until the next whitespace or
    parenthesis. The parsed token will be returned and the position will be
    advanced.

#+BEGIN_SRC rust
impl<'a> Iterator for Tokenizer<'a> {
    type Item = &'a str;

    fn next(&mut self) -> Option<Self::Item> {
        // 1. Skip whitespace.
        if let Some(offset) = self.input[self.position..]
            .chars()
            .position(|c| !c.is_whitespace())
        {
            self.position += offset
        }
        if self.position >= self.input.len() {
            return None;
        }

        // 2a. Handle parens
        let start = self.position;
        let ch = &self.input[start..start + 1];
        if matches!(ch, "(" | ")") {
            self.position += 1;
            return Some(ch);
        }
        // 2b. Handle identifiers
        let token = self
            .input
            .get(start..)?
            .split(|c: char| c.is_whitespace() || c == '(' || c == ')')
            .next()?;
        self.position += token.len();
        Some(token)
    }
}
#+END_SRC

This is a minimal implementation that will get us through our current
implementation. However, at some point you may want to have special handling for
strings which may include whitespace. It also returns the string and throws away
the position information. Positional information is useful for providing debug
information to the downstream processing.

