content/post/2025/11/15/lisp-1.org
** Reading

The reader converts the token stream into Lisp values:

- Identifiers are parsed as integers, booleans, or symbols.
- A ~(~ begins a list; elements are parsed until the matching ~)~.
- If there’s no closing ~)~, we signal an error.

#+BEGIN_SRC rust
#[test]
fn test_read() {
    let mut tokenizer = Tokenizer::new("42 #true + (+ (* 2 3) 4)");
    assert_eq!(read_next(&mut tokenizer).unwrap(), Some(Val::Int(42)));
    assert_eq!(read_next(&mut tokenizer).unwrap(), Some(Val::Bool(true)));
    assert_eq!(read_next(&mut tokenizer).unwrap(), Some(Val::Symbol("+".to_string())));
    assert_eq!(
        read_next(&mut tokenizer).unwrap(),
        Some(Val::List(vec![
            Val::Symbol("+".to_string()),
            Val::List(vec![
                Val::Symbol("*".to_string()),
                Val::Int(2),
                Val::Int(3)
            ]),
            Val::Int(4)
        ]))
    );
    assert_eq!(read_next(&mut tokenizer).unwrap(), None);
}

#[test]
fn test_read_unmatched_paren() {
    let mut tokenizer = Tokenizer::new("(+ 1 2");
    assert!(matches!(
        read_next(&mut tokenizer),
        Err(TokenizerError::UnexpectedEndOfInput)
    ));
}

#[test]
fn test_read_extra_closing_paren() {
    let mut tokenizer = Tokenizer::new(")");
    assert!(matches!(
        read_next(&mut tokenizer),
        Err(TokenizerError::UnexpectedEndOfInput)
    ));
}
#+END_SRC

To accomplish this, we'll create a helper that can parse the next thing. The
results can be:

#+BEGIN_SRC rust
  enum ReadItem {
      // The end of an expression was
      // reached. The end is signaled with a
      // closing parenthesis.
      EndExpr,
      // A value was parsed.
      Val(Val),
      // There were no more values.
      None,
  }
#+END_SRC

When parsing the next token, the options are:

1. There are no more tokens so ~ReadItem::None~.
2. An identifier was encountered so ~ReadItem::Val~.
   - The identifier could be an integer as well. If not, then it is a "symbol"
     that our interpreter will use to bind variables and function names.
3. When a closing parenthesis is encountered, then its an ~ReadItem::EndExpr~. In a
   normal context this is syntax error.
4. An opening parenthesis is encounterd, then we recursively call
   ~read_next_impl~ until a ~ReadItem::EndExpr~ is encountered.

#+BEGIN_SRC rust
#[derive(Copy, Clone, Debug, PartialEq)]
pub enum TokenizerError {
    UnexpectedEndOfInput,
}

fn read_next_impl(tokenizer: &mut Tokenizer) -> Result<ReadItem, TokenizerError> {
    match tokenizer.next() {
        None => Ok(ReadItem::None),
        Some("#true") => Ok(ReadItem::Val(Val::Bool(true))),
        Some("#false") => Ok(ReadItem::Val(Val::Bool(false))),
        Some("(") => {
            let mut res = Vec::new();
            loop {
                match read_next_impl(tokenizer)? {
                    ReadItem::EndExpr => return Ok(ReadItem::Val(Val::List(res))),
                    ReadItem::Val(v) => res.push(v),
                    ReadItem::None => return Err(TokenizerError::UnexpectedEndOfInput),
                }
            }
        }
        Some(")") => Ok(ReadItem::EndExpr),
        Some(identifier @ _) => {
            let val = if let Ok(int_val) = identifier.parse::<i64>() {
                Val::Int(int_val)
            } else {
                Val::Symbol(identifier.to_string())
            };
            Ok(ReadItem::Val(val))
        }
    }
}
#+END_SRC

To finish our implementation, we wrap our helper:

#+BEGIN_SRC rust

pub fn read_next(tokenizer: &mut Tokenizer) -> Result<Option<Val>, TokenizerError> {
    match read_next_impl(tokenizer)? {
        ReadItem::EndExpr => Err(TokenizerError::UnexpectedEndOfInput),
        ReadItem::Val(val) => Ok(Some(val)),
        ReadItem::None => Ok(None),
    }
}
#+END_SRC
