public/post/2025/11/15/lisp-1.html
<div id="outline-container-org0557f95" class="outline-3">
<h3 id="org0557f95"><span class="section-number-3">4.2.</span> Reading</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The reader converts the token stream into Lisp values:
</p>

<ul class="org-ul">
<li>Identifiers are parsed as integers, booleans, or symbols.</li>
<li>A <code>(</code> begins a list; elements are parsed until the matching <code>)</code>.</li>
<li>If there’s no closing <code>)</code>, we signal an error.</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-preprocessor">#[test]</span>
<span class="org-keyword">fn</span> <span class="org-function-name">test_read</span>() {
    <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">tokenizer</span> = <span class="org-type">Tokenizer</span>::new(<span class="org-string">"42 #true + (+ (* 2 3) 4)"</span>);
    <span class="org-preprocessor">assert_eq!</span>(read_next(<span class="org-rust-ampersand">&amp;</span><span class="org-keyword">mut</span> tokenizer).unwrap(), <span class="org-type">Some</span>(<span class="org-type">Val</span>::<span class="org-type">Int</span>(42)));
    <span class="org-preprocessor">assert_eq!</span>(read_next(<span class="org-rust-ampersand">&amp;</span><span class="org-keyword">mut</span> tokenizer).unwrap(), <span class="org-type">Some</span>(<span class="org-type">Val</span>::<span class="org-type">Bool</span>(<span class="org-keyword">true</span>)));
    <span class="org-preprocessor">assert_eq!</span>(read_next(<span class="org-rust-ampersand">&amp;</span><span class="org-keyword">mut</span> tokenizer).unwrap(), <span class="org-type">Some</span>(<span class="org-type">Val</span>::<span class="org-type">Symbol</span>(<span class="org-string">"+"</span>.to_string())));
    <span class="org-preprocessor">assert_eq!</span>(
        read_next(<span class="org-rust-ampersand">&amp;</span><span class="org-keyword">mut</span> tokenizer).unwrap(),
        <span class="org-type">Some</span>(<span class="org-type">Val</span>::<span class="org-type">List</span>(<span class="org-preprocessor">vec!</span>[
            <span class="org-type">Val</span>::<span class="org-type">Symbol</span>(<span class="org-string">"+"</span>.to_string()),
            <span class="org-type">Val</span>::<span class="org-type">List</span>(<span class="org-preprocessor">vec!</span>[
                <span class="org-type">Val</span>::<span class="org-type">Symbol</span>(<span class="org-string">"*"</span>.to_string()),
                <span class="org-type">Val</span>::<span class="org-type">Int</span>(2),
                <span class="org-type">Val</span>::<span class="org-type">Int</span>(3)
            ]),
            <span class="org-type">Val</span>::<span class="org-type">Int</span>(4)
        ]))
    );
    <span class="org-preprocessor">assert_eq!</span>(read_next(<span class="org-rust-ampersand">&amp;</span><span class="org-keyword">mut</span> tokenizer).unwrap(), <span class="org-type">None</span>);
}

<span class="org-preprocessor">#[test]</span>
<span class="org-keyword">fn</span> <span class="org-function-name">test_read_unmatched_paren</span>() {
    <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">tokenizer</span> = <span class="org-type">Tokenizer</span>::new(<span class="org-string">"(+ 1 2"</span>);
    <span class="org-preprocessor">assert!</span>(<span class="org-preprocessor">matches!</span>(
        read_next(<span class="org-rust-ampersand">&amp;</span><span class="org-keyword">mut</span> tokenizer),
        <span class="org-type">Err</span>(<span class="org-type">TokenizerError</span>::<span class="org-type">UnexpectedEndOfInput</span>)
    ));
}

<span class="org-preprocessor">#[test]</span>
<span class="org-keyword">fn</span> <span class="org-function-name">test_read_extra_closing_paren</span>() {
    <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">tokenizer</span> = <span class="org-type">Tokenizer</span>::new(<span class="org-string">")"</span>);
    <span class="org-preprocessor">assert!</span>(<span class="org-preprocessor">matches!</span>(
        read_next(<span class="org-rust-ampersand">&amp;</span><span class="org-keyword">mut</span> tokenizer),
        <span class="org-type">Err</span>(<span class="org-type">TokenizerError</span>::<span class="org-type">UnexpectedEndOfInput</span>)
    ));
}
</pre>
</div>

<p>
To accomplish this, we'll create a helper that can parse the next thing. The
results can be:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-keyword">enum</span> <span class="org-type">ReadItem</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">The end of an expression was reached. The end is signaled with a closing
</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">parenthesis.
</span>    <span class="org-type">EndExpr</span>,
    <span class="org-comment-delimiter">// </span><span class="org-comment">A value was parsed.
</span>    <span class="org-type">Val</span>(<span class="org-type">Val</span>),
    <span class="org-comment-delimiter">// </span><span class="org-comment">There were no more values.
</span>    <span class="org-type">None</span>,
}
</pre>
</div>

<p>
When parsing the next token, the options are:
</p>

<ol class="org-ol">
<li>There are no more tokens so <code>ReadItem::None</code>.</li>
<li>An identifier was encountered so <code>ReadItem::Val</code>.
<ul class="org-ul">
<li>The identifier could be an integer as well. If not, then it is a "symbol"
that our interpreter will use to bind variables and function names.</li>
</ul></li>
<li>When a closing parenthesis is encountered, then its an <code>ReadItem::EndExpr</code>. In a
normal context this is syntax error.</li>
<li>An opening parenthesis is encounterd, then we recursively call
<code>read_next_impl</code> until a <code>ReadItem::EndExpr</code> is encountered.</li>
</ol>

<div class="org-src-container">
<pre class="src src-rust"><span class="org-preprocessor">#[derive(Copy, Clone, Debug, PartialEq)]</span>
<span class="org-keyword">pub</span> <span class="org-keyword">enum</span> <span class="org-type">TokenizerError</span> {
    <span class="org-type">UnexpectedEndOfInput</span>,
}

<span class="org-keyword">fn</span> <span class="org-function-name">read_next_impl</span>(<span class="org-variable-name">tokenizer</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-keyword">mut</span> <span class="org-type">Tokenizer</span>) -&gt; <span class="org-type">Result</span>&lt;<span class="org-type">ReadItem</span>, <span class="org-type">TokenizerError</span>&gt; {
    <span class="org-keyword">match</span> tokenizer.next() {
        <span class="org-type">None</span> =&gt; <span class="org-type">Ok</span>(<span class="org-type">ReadItem</span>::<span class="org-type">None</span>),
        <span class="org-type">Some</span>(<span class="org-string">"#true"</span>) =&gt; <span class="org-type">Ok</span>(<span class="org-type">ReadItem</span>::<span class="org-type">Val</span>(<span class="org-type">Val</span>::<span class="org-type">Bool</span>(<span class="org-keyword">true</span>))),
        <span class="org-type">Some</span>(<span class="org-string">"#false"</span>) =&gt; <span class="org-type">Ok</span>(<span class="org-type">ReadItem</span>::<span class="org-type">Val</span>(<span class="org-type">Val</span>::<span class="org-type">Bool</span>(<span class="org-keyword">false</span>))),
        <span class="org-type">Some</span>(<span class="org-string">"("</span>) =&gt; {
            <span class="org-keyword">let</span> <span class="org-keyword">mut</span> <span class="org-variable-name">res</span> = <span class="org-type">Vec</span>::new();
            <span class="org-keyword">loop</span> {
                <span class="org-keyword">match</span> read_next_impl(tokenizer)<span class="org-rust-question-mark">?</span> {
                    <span class="org-type">ReadItem</span>::<span class="org-type">EndExpr</span> =&gt; <span class="org-keyword">return</span> <span class="org-type">Ok</span>(<span class="org-type">ReadItem</span>::<span class="org-type">Val</span>(<span class="org-type">Val</span>::<span class="org-type">List</span>(res))),
                    <span class="org-type">ReadItem</span>::<span class="org-type">Val</span>(v) =&gt; res.push(v),
                    <span class="org-type">ReadItem</span>::<span class="org-type">None</span> =&gt; <span class="org-keyword">return</span> <span class="org-type">Err</span>(<span class="org-type">TokenizerError</span>::<span class="org-type">UnexpectedEndOfInput</span>),
                }
            }
        }
        <span class="org-type">Some</span>(<span class="org-string">")"</span>) =&gt; <span class="org-type">Ok</span>(<span class="org-type">ReadItem</span>::<span class="org-type">EndExpr</span>),
        <span class="org-type">Some</span>(identifier @ _) =&gt; {
            <span class="org-keyword">let</span> <span class="org-variable-name">val</span> = <span class="org-keyword">if</span> <span class="org-keyword">let</span> <span class="org-type">Ok</span>(int_val) = identifier.parse::&lt;<span class="org-type">i64</span>&gt;() {
                <span class="org-type">Val</span>::<span class="org-type">Int</span>(int_val)
            } <span class="org-keyword">else</span> {
                <span class="org-type">Val</span>::<span class="org-type">Symbol</span>(identifier.to_string())
            };
            <span class="org-type">Ok</span>(<span class="org-type">ReadItem</span>::<span class="org-type">Val</span>(val))
        }
    }
}
</pre>
</div>

<p>
To finish our implementation, we wrap our helper:
</p>

<div class="org-src-container">
<pre class="src src-rust">
<span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">read_next</span>(<span class="org-variable-name">tokenizer</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-keyword">mut</span> <span class="org-type">Tokenizer</span>) -&gt; <span class="org-type">Result</span>&lt;<span class="org-type">Option</span>&lt;<span class="org-type">Val</span>&gt;, <span class="org-type">TokenizerError</span>&gt; {
    <span class="org-keyword">match</span> read_next_impl(tokenizer)<span class="org-rust-question-mark">?</span> {
        <span class="org-type">ReadItem</span>::<span class="org-type">EndExpr</span> =&gt; <span class="org-type">Err</span>(<span class="org-type">TokenizerError</span>::<span class="org-type">UnexpectedEndOfInput</span>),
        <span class="org-type">ReadItem</span>::<span class="org-type">Val</span>(val) =&gt; <span class="org-type">Ok</span>(<span class="org-type">Some</span>(val)),
        <span class="org-type">ReadItem</span>::<span class="org-type">None</span> =&gt; <span class="org-type">Ok</span>(<span class="org-type">None</span>),
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<div></div>
<p class="postamble-title">Title: Building a Lisp Interpreter (in Rust) - Part 1</p>
<p class="author">Author: Will S. Medrano</p>
<p class="date">Date: 2025-11-06</p>
</div>
</body>
</html>
